Tekla.Structures.ModuleManager.Modules.MultimaterialModeling
Indicates whether the multimaterial modeling is enabled.

Tekla.Structures.ModuleManager.Modules.LoadModeling
Indicates whether the load modeling is enabled.

Tekla.Structures.ModuleManager.Modules.SteelDetailing
Indicates whether the steel detailing is enabled.

Tekla.Structures.ModuleManager.Modules.ConcreteDetailing
Indicates whether the concrete detailing is enabled.

Tekla.Structures.ModuleManager.Modules.RebarModeling
Indicates whether the rebar modeling is enabled.

Tekla.Structures.ModuleManager.Modules.CIPModeling
Indicates whether the CIP modeling is enabled.

Tekla.Structures.ModuleManager.Modules.AnalysisAndDesign
Indicates whether the Analysis and Design management is enabled.

Tekla.Structures.ModuleManager.Modules.TaskManagement
Indicates whether the task management is enabled.